espressif/esp-idf/components/soc/esp32c5/register/soc/lp_gpio_reg.h
/** LP_GPIO_FUNC1_OUT_SEL_CFG_REG register
 *  GPIO output function select register
 */
#define LP_GPIO_FUNC1_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2b4)
/** LP_GPIO_FUNC1_OUT_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  set this bit to invert output signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC1_OUT_INV_SEL    (BIT(0))
#define LP_GPIO_FUNC1_OUT_INV_SEL_M  (LP_GPIO_FUNC1_OUT_INV_SEL_V << LP_GPIO_FUNC1_OUT_INV_SEL_S)
#define LP_GPIO_FUNC1_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC1_OUT_INV_SEL_S  0
/** LP_GPIO_FUNC1_OE_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  set this bit to invert output enable signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC1_OE_INV_SEL    (BIT(2))
#define LP_GPIO_FUNC1_OE_INV_SEL_M  (LP_GPIO_FUNC1_OE_INV_SEL_V << LP_GPIO_FUNC1_OE_INV_SEL_S)
#define LP_GPIO_FUNC1_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC1_OE_INV_SEL_S  2

/** LP_GPIO_FUNC2_OUT_SEL_CFG_REG register
 *  GPIO output function select register
 */
#define LP_GPIO_FUNC2_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2b8)
/** LP_GPIO_FUNC2_OUT_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  set this bit to invert output signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC2_OUT_INV_SEL    (BIT(0))
#define LP_GPIO_FUNC2_OUT_INV_SEL_M  (LP_GPIO_FUNC2_OUT_INV_SEL_V << LP_GPIO_FUNC2_OUT_INV_SEL_S)
#define LP_GPIO_FUNC2_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC2_OUT_INV_SEL_S  0
/** LP_GPIO_FUNC2_OE_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  set this bit to invert output enable signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC2_OE_INV_SEL    (BIT(2))
#define LP_GPIO_FUNC2_OE_INV_SEL_M  (LP_GPIO_FUNC2_OE_INV_SEL_V << LP_GPIO_FUNC2_OE_INV_SEL_S)
#define LP_GPIO_FUNC2_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC2_OE_INV_SEL_S  2

/** LP_GPIO_FUNC3_OUT_SEL_CFG_REG register
 *  GPIO output function select register
 */
#define LP_GPIO_FUNC3_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2bc)
/** LP_GPIO_FUNC3_OUT_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  set this bit to invert output signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC3_OUT_INV_SEL    (BIT(0))
#define LP_GPIO_FUNC3_OUT_INV_SEL_M  (LP_GPIO_FUNC3_OUT_INV_SEL_V << LP_GPIO_FUNC3_OUT_INV_SEL_S)
#define LP_GPIO_FUNC3_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC3_OUT_INV_SEL_S  0
/** LP_GPIO_FUNC3_OE_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  set this bit to invert output enable signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC3_OE_INV_SEL    (BIT(2))
#define LP_GPIO_FUNC3_OE_INV_SEL_M  (LP_GPIO_FUNC3_OE_INV_SEL_V << LP_GPIO_FUNC3_OE_INV_SEL_S)
#define LP_GPIO_FUNC3_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC3_OE_INV_SEL_S  2

/** LP_GPIO_FUNC4_OUT_SEL_CFG_REG register
 *  GPIO output function select register
 */
#define LP_GPIO_FUNC4_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2c0)
/** LP_GPIO_FUNC4_OUT_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  set this bit to invert output signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC4_OUT_INV_SEL    (BIT(0))
#define LP_GPIO_FUNC4_OUT_INV_SEL_M  (LP_GPIO_FUNC4_OUT_INV_SEL_V << LP_GPIO_FUNC4_OUT_INV_SEL_S)
#define LP_GPIO_FUNC4_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC4_OUT_INV_SEL_S  0
/** LP_GPIO_FUNC4_OE_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  set this bit to invert output enable signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC4_OE_INV_SEL    (BIT(2))
#define LP_GPIO_FUNC4_OE_INV_SEL_M  (LP_GPIO_FUNC4_OE_INV_SEL_V << LP_GPIO_FUNC4_OE_INV_SEL_S)
#define LP_GPIO_FUNC4_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC4_OE_INV_SEL_S  2

/** LP_GPIO_FUNC5_OUT_SEL_CFG_REG register
 *  GPIO output function select register
 */
#define LP_GPIO_FUNC5_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2c4)
/** LP_GPIO_FUNC5_OUT_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  set this bit to invert output signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC5_OUT_INV_SEL    (BIT(0))
#define LP_GPIO_FUNC5_OUT_INV_SEL_M  (LP_GPIO_FUNC5_OUT_INV_SEL_V << LP_GPIO_FUNC5_OUT_INV_SEL_S)
#define LP_GPIO_FUNC5_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC5_OUT_INV_SEL_S  0
/** LP_GPIO_FUNC5_OE_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  set this bit to invert output enable signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC5_OE_INV_SEL    (BIT(2))
#define LP_GPIO_FUNC5_OE_INV_SEL_M  (LP_GPIO_FUNC5_OE_INV_SEL_V << LP_GPIO_FUNC5_OE_INV_SEL_S)
#define LP_GPIO_FUNC5_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC5_OE_INV_SEL_S  2

/** LP_GPIO_FUNC6_OUT_SEL_CFG_REG register
 *  GPIO output function select register
 */
#define LP_GPIO_FUNC6_OUT_SEL_CFG_REG (DR_REG_LP_GPIO_BASE + 0x2c8)
/** LP_GPIO_FUNC6_OUT_INV_SEL : R/W; bitpos: [0]; default: 0;
 *  set this bit to invert output signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC6_OUT_INV_SEL    (BIT(0))
#define LP_GPIO_FUNC6_OUT_INV_SEL_M  (LP_GPIO_FUNC6_OUT_INV_SEL_V << LP_GPIO_FUNC6_OUT_INV_SEL_S)
#define LP_GPIO_FUNC6_OUT_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC6_OUT_INV_SEL_S  0
/** LP_GPIO_FUNC6_OE_INV_SEL : R/W; bitpos: [2]; default: 0;
 *  set this bit to invert output enable signal.1:invert.0:not invert.
 */
#define LP_GPIO_FUNC6_OE_INV_SEL    (BIT(2))
#define LP_GPIO_FUNC6_OE_INV_SEL_M  (LP_GPIO_FUNC6_OE_INV_SEL_V << LP_GPIO_FUNC6_OE_INV_SEL_S)
#define LP_GPIO_FUNC6_OE_INV_SEL_V  0x00000001U
#define LP_GPIO_FUNC6_OE_INV_SEL_S  2

/** LP_GPIO_CLOCK_GATE_REG register
 *  GPIO clock gate register
 */
#define LP_GPIO_CLOCK_GATE_REG (DR_REG_LP_GPIO_BASE + 0x3f8)
/** LP_GPIO_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  set this bit to enable GPIO clock gate
 */
#define LP_GPIO_CLK_EN    (BIT(0))
#define LP_GPIO_CLK_EN_M  (LP_GPIO_CLK_EN_V << LP_GPIO_CLK_EN_S)
#define LP_GPIO_CLK_EN_V  0x00000001U
#define LP_GPIO_CLK_EN_S  0

/** LP_GPIO_DATE_REG register
 *  GPIO version register
 */
#define LP_GPIO_DATE_REG (DR_REG_LP_GPIO_BASE + 0x3fc)
/** LP_GPIO_DATE : R/W; bitpos: [27:0]; default: 37814832;
 *  version register
 */
#define LP_GPIO_DATE    0x0FFFFFFFU
#define LP_GPIO_DATE_M  (LP_GPIO_DATE_V << LP_GPIO_DATE_S)
#define LP_GPIO_DATE_V  0x0FFFFFFFU
#define LP_GPIO_DATE_S  0

#ifdef __cplusplus
}
#endif
